Tekla Open API Reference for Tekla Structures 2025
Beam Constructor (Beam.BeamTypeEnum)
 Initializes a new instance of the Beam class by using the defined type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Beam(
	Beam.BeamTypeEnum beamType
)
Public Sub New (
	beamType As Beam.BeamTypeEnum
)
Parameters
beamType
Type: Tekla.Structures.Model.Beam.BeamTypeEnum
The type of the beam.
See Also
Reference
Beam Class
Beam Overload
Tekla.Structures.Model Namespace